#include <arpa/inet.h>
#include <ctype.h>
#include <fcntl.h>
#include <netinet/in.h>
#include <stdio.h>
#include <string.h>
#include <sys/socket.h>
#include <sys/stat.h>
#include <sys/types.h>
#include <unistd.h>

#define ISspace(x) isspace((int)(x))
#define _cplusplus
#ifdef _cplusplus
extern "C" {
#endif
static int get_line(int sock, char* buf, int size);
/*****************************************************************
     * 发送 协议体（文件）
     * **************************************************************/
static void sendFile(int client, FILE* resource);
/*****************************************************************
     * 发送 协议头
     * **************************************************************/
void headers(int client, const char* filename);
/****************************************************************
     * 主程序
     * **************************************************************/
static void accept_request(void* arg);
/*****************************************************************
     * 发送 协议头+协议体（文件）
     * **************************************************************/
void serve_file(int client, const char* filename);
/*****************************************************************
     * 状态码
     * ****************************************************************
    /******************************************************************
     * 
     * 400
     * 
     * ****************************************************************/
static void badRequest(int client);
/******************************************************************
     * 
     * 501
     * 
     * ****************************************************************/
void unimplemented(int client);

/******************************************************************
     * 
     * 404
     * 
     * ****************************************************************/
void not_found(int client);

#ifdef _cplusplus
}
#endif
